txwinrm/request/enum_shells.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsen="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"> 
  <s:Header> 
    <wsa:To>http://SORINOTEST05:5985/wsman</wsa:To> 
    <wsman:ResourceURI s:mustUnderstand="true"> http://schemas.microsoft.com/wbem/wsman/1/windows/shell </wsman:ResourceURI> 
    <wsa:ReplyTo> 
      <wsa:Address s:mustUnderstand="true"> http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous </wsa:Address> 
    </wsa:ReplyTo> 
    <wsa:Action s:mustUnderstand="true"> http://schemas.xmlsoap.org/ws/2004/09/enumeration/Enumerate </wsa:Action> 
    <wsman:MaxEnvelopeSize s:mustUnderstand="true">153600</wsman:MaxEnvelopeSize> 
    <wsa:MessageID>uuid:08E59736-6A1B-4560-8442-64E4D7A26EB5</wsa:MessageID> 
    <wsman:Locale xml:lang="en-US" s:mustUnderstand="false" /> 
    <wsman:OperationTimeout>PT60.000S</wsman:OperationTimeout> 
  </s:Header> 
  <s:Body> 
    <wsen:Enumerate> </wsen:Enumerate> 
  </s:Body> 
</s:Envelope>

